[
	[{
		"skill": "HTML5",
		"description": "Like many people, my journey in web development started with HTML.  After starting to write out bigger pages, I quickly learned the importance of proper indentation and organization with the use of semantic tags.",
		"itag_class": "devicon-html5-plain"
	}, {
		"skill": "CSS3",
		"description": "I started studying CSS in summer 2014, going over several courses on Team Treehouse and Code School, as well as reading a few books.  At first, I learned all about the box model and media queries, got frustrated with positioning for a while, and got into animations and other techniques.  Then I discovered the usefulness of using Sass and frameworks such as Bootstrap.",
		"itag_class": "devicon-css3-plain"
	}, {
		"skill": "JavaScript",
		"description": "I can work with both client side and server side JavaScript.",
		"itag_class": "devicon-javascript-plain"
	}, {
		"skill": "jQuery",
		"description": "I use jQuery for a multitude of purposes, from adding basic DOM functionality to a page to making ajax calls and working with various APIs.  The current site you are on uses jQuery.",
		"itag_class": "devicon-jquery-plain"
	}, {
		"skill": "Sass",
		"description": "In late 2014, when I discovered that I could use Sass to include things like functions, mixins and variables as part of the styling process, I asked myself why I had spent hours writing out repetitive CSS.  I have been using scss ever since.",
		"itag_class": "devicon-sass-original"
	}, {
		"skill": "Bootstrap",
		"description": "I use Bootstrap and other frameworks (this site uses Materialize) to facilitate and speed up development with the use of a grid system that has built in JS components.",
		"itag_class": "devicon-bootstrap-plain"
	}, {
		"skill": "Angular",
		"description": "I learned how to use Angular during my time at Rutgers Coding Bootcamp.  I like Angular because of its two way data binding, as well as being able to manipulate data through controllers and views using its UI router.",
		"itag_class": "devicon-angularjs-plain"
	}],
	[{
		"skill": "Node",
		"description": "",
		"itag_class": "devicon-nodejs-plain"
	}, {
		"skill": "MongoDB",
		"description": "",
		"itag_class": "devicon-mongodb-plain"
	}, {
		"skill": "MySQL",
		"description": "",
		"itag_class": "devicon-mysql-plain"
	}],
	[{
		"skill": "Git",
		"description": "I use Git as my version control system, which allows me to create new branches and go back to previous work if necessary.",
		"itag_class": "devicon-git-plain"
	}, {
		"skill": "GitHub",
		"description": "I use GitHub to save my work online as a backup or if I am working collaboratively on a project.  For more information, please check the link to my profile in the navigation bar dropdown menu.",
		"itag_class": "devicon-github-plain"
	}, {
		"skill": "Heroku",
		"description": "When I first started development, I used FTP to upload files.  More recently, I have been deploying to the Heroku cloud platform.",
		"itag_class": "devicon-heroku-line"
	}, {
		"skill": "Trello",
		"description": "I have used Trello as an organizational tool to list issues and progress on larger projects involving multiple developers.",
		"itag_class": "devicon-trello-plain"
	}]
]